backend/controllers/AutoreplyController.php

    public function actionEdit()
    {
        include dirname(dirname(__FILE__)).'/libs/LaneWeChat/lanewechat.php';
        include dirname(dirname(__FILE__)).'/libs/LaneWeChat/core/source.lib.php';
        include dirname(dirname(__FILE__)).'/libs/LaneWeChat/core/templatemessage.lib.php';
        include dirname(dirname(__FILE__)).'/libs/LaneWeChat/core/advancedbroadcast.lib.php';
        include dirname(dirname(__FILE__)).'/libs/LaneWeChat/core/usermanage.lib.php';
        $id = Yii::$app->request->get('id');
        $model = IndexKeywords::findOne($id);
---
SELECT * FROM `index_keywords` WHERE `id`='2'

    public function actionDelete()
    {
        $query = Yii::$app->request->queryParams;
        $id = $query['id'];
        $data = IndexKeywords::findOne($id);
        if(file_exists($data['pic_path'])) {
            unlink($data['pic_path']);
        }
        $data->delete();
---
SELECT * FROM `index_keywords` WHERE `id`='6'
DELETE FROM `index_keywords` WHERE `id`=6