backend/models/SmsAdmin.php

SELECT * FROM `sms_admin` WHERE `username`='admin'
---
    public static function findByUsername($username) {
        $user = SmsAdmin::find()->where(['username' => $username])->one();